load_testing_results_apache_bench.txt
*** /team/get ENDPOINT ***
Command: ab -n 100 -c 10 "http://localhost:8080/team/get?team_name=load_test_team"
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /team/get?team_name=load_test_team
Document Length:        104 bytes

Concurrency Level:      10
Time taken for tests:   0.143 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      21300 bytes
HTML transferred:       10400 bytes
Requests per second:    701.35 [#/sec] (mean)
Time per request:       14.258 [ms] (mean)
Time per request:       1.426 [ms] (mean, across all concurrent requests)
Transfer rate:          145.89 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.4      0       2
Processing:     6   13   3.4     12      24
Waiting:        5   13   3.4     12      23
Total:          6   13   3.5     12      24

Percentage of the requests served within a certain time (ms)
  50%     12
  66%     14
  75%     15
  80%     17
  90%     18
  95%     20
  98%     23
  99%     24
 100%     24 (longest request)

*** /users/setIsActive ENDPOINT ***
Command: ab -n 100 -c 10 -p user_active.json -T application/json http://localhost:8080/users/setIsActive
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /users/setIsActive
Document Length:        99 bytes

Concurrency Level:      10
Time taken for tests:   0.263 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      20700 bytes
Total body sent:        19900
HTML transferred:       9900 bytes
Requests per second:    380.04 [#/sec] (mean)
Time per request:       26.313 [ms] (mean)
Time per request:       2.631 [ms] (mean, across all concurrent requests)
Transfer rate:          76.82 [Kbytes/sec] received
                        73.86 kb/s sent
                        150.68 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     5   24  16.0     20      95
Waiting:        5   24  16.0     19      95
Total:          5   24  16.0     20      96

Percentage of the requests served within a certain time (ms)
  50%     20
  66%     26
  75%     29
  80%     33
  90%     49
  95%     63
  98%     66
  99%     96
 100%     96 (longest request)

*** /users/getReview ENDPOINT ***
Command: ab -n 100 -c 10 "http://localhost:8080/users/getReview?user_id=u1"
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /users/getReview?user_id=u1
Document Length:        35 bytes

Concurrency Level:      10
Time taken for tests:   0.112 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      14300 bytes
HTML transferred:       3500 bytes
Requests per second:    894.22 [#/sec] (mean)
Time per request:       11.183 [ms] (mean)
Time per request:       1.118 [ms] (mean, across all concurrent requests)
Transfer rate:          124.88 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     5   10   2.3     10      17
Waiting:        4   10   2.3     10      16
Total:          5   10   2.2     10      17

Percentage of the requests served within a certain time (ms)
  50%     10
  66%     11
  75%     12
  80%     12
  90%     14
  95%     15
  98%     16
  99%     17
 100%     17 (longest request)

*** /pullRequest/reassign ENDPOINT ***
Command: ab -n 100 -c 10 -p pr_reassign.json -T application/json http://localhost:8080/pullRequest/reassign
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /pullRequest/reassign
Document Length:        65 bytes

Concurrency Level:      10
Time taken for tests:   0.082 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      18200 bytes
Total body sent:        29400
HTML transferred:       6500 bytes
Requests per second:    1224.41 [#/sec] (mean)
Time per request:       8.167 [ms] (mean)
Time per request:       0.817 [ms] (mean, across all concurrent requests)
Transfer rate:          217.62 [Kbytes/sec] received
                        351.54 kb/s sent
                        569.16 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     3    7   2.6      7      15
Waiting:        2    7   2.6      6      14
Total:          3    7   2.6      7      15

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      8
  75%      9
  80%      9
  90%     12
  95%     12
  98%     15
  99%     15
 100%     15 (longest request)

*** /pullRequest/merge ENDPOINT ***
Command: ab -n 100 -c 10 -p pr_merge.json -T application/json http://localhost:8080/pullRequest/merge
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /pullRequest/merge
Document Length:        239 bytes

Concurrency Level:      10
Time taken for tests:   0.105 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      34800 bytes
Total body sent:        19900
HTML transferred:       23900 bytes
Requests per second:    955.68 [#/sec] (mean)
Time per request:       10.464 [ms] (mean)
Time per request:       1.046 [ms] (mean, across all concurrent requests)
Transfer rate:          324.78 [Kbytes/sec] received
                        185.72 kb/s sent
                        510.51 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     4    9   2.1      9      15
Waiting:        4    9   2.1      9      14
Total:          4   10   2.2      9      15

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     11
  75%     11
  80%     12
  90%     12
  95%     13
  98%     15
  99%     15
 100%     15 (longest request)

*** /pullRequest/create ENDPOINT***
Command: ab -n 100 -c 10 -p /tmp/pr_1.json -T application/json http://localhost:8080/pullRequest/create
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /pullRequest/create
Document Length:        61 bytes

Concurrency Level:      10
Time taken for tests:   0.099 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      17600 bytes
Total body sent:        27600
HTML transferred:       6100 bytes
Requests per second:    1012.09 [#/sec] (mean)
Time per request:       9.881 [ms] (mean)
Time per request:       0.988 [ms] (mean, across all concurrent requests)
Transfer rate:          173.95 [Kbytes/sec] received
                        272.79 kb/s sent
                        446.74 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     4    9   2.3      9      14
Waiting:        4    8   2.1      9      13
Total:          5    9   2.2      9      14

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     11
  80%     11
  90%     12
  95%     13
  98%     14
  99%     14
 100%     14 (longest request)

*** /team/add ENDPOINT ***
Command: Sequential testing with 100 unique teams
Team creation completed. Testing with ab for performance...
Performance test command: ab -n 100 -c 10 -p /tmp/team_perf_test.json -T application/json http://localhost:8080/team/add
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /team/add
Document Length:        69 bytes

Concurrency Level:      10
Time taken for tests:   0.097 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      18300 bytes
Total body sent:        37900
HTML transferred:       6900 bytes
Requests per second:    1030.21 [#/sec] (mean)
Time per request:       9.707 [ms] (mean)
Time per request:       0.971 [ms] (mean, across all concurrent requests)
Transfer rate:          184.11 [Kbytes/sec] received
                        381.30 kb/s sent
                        565.41 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       1
Processing:     4    9   2.5      9      14
Waiting:        3    8   2.3      8      14
Total:          4    9   2.4      9      15

Percentage of the requests served within a certain time (ms)
  50%      9
  66%     10
  75%     11
  80%     11
  90%     12
  95%     13
  98%     14
  99%     15
 100%     15 (longest request)